# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [4,5,  8,10,  13,16]  # P3/8
  - [23,29,  43,55,  73,105]  # P4/16
  - [146,217,  231,300,  335,433]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, StemBlock, [24, 3, 2]], # 0-P2/4
   [-1, 2, BlazeBlock, [24]], # 1
   [-1, 1, BlazeBlock, [48, None, 2]], # 2-P3/8
   [-1, 2, BlazeBlock, [48]], # 3
   [-1, 1, DoubleBlazeBlock, [96, 24, 2]], # 4-P4/16
   [-1, 2, DoubleBlazeBlock, [96, 24]], # 5
   [-1, 1, DoubleBlazeBlock, [96, 24, 2]], # 6-P5/32
   [-1, 2, DoubleBlazeBlock, [96, 24]], # 7
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [48, 1, 1]],  # 8 (P5/32-large)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [48, 1, 1]],  # 11 (P4/16-medium)

   [-1, 1, Conv, [48, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [48, 1, 1]],  # 15 (P3/8-small)

   [[15, 11, 8], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
